XMegaForArduino/arduino/variants/xmega32e5/pins_arduino.h
#define PORTD_INT0  0
#define PORTC_INT0  1
#define PORTA_INT0  2
#define PORTR_INT0  3

#define EXTERNAL_NUM_INTERRUPTS 4 /* defined here instead of wiring_private.h */

// was in wiring_external.h, moved here
#define EXTERNAL_INT_0 0
#define EXTERNAL_INT_1 1
#define EXTERNAL_INT_2 2
#define EXTERNAL_INT_3 3
//#define EXTERNAL_INT_4 4
//#define EXTERNAL_INT_5 5
//#define EXTERNAL_INT_6 6
//#define EXTERNAL_INT_7 7


// xmega 'E' series has 2 sets of UART and SPI.
// The default UART is assigned on Port D, pins PD2-3
// The default SPI is assigned on Port C, pins PC4-7
//
// There is only ONE TWI on the 'E' series, on port C pins 0,1
//
// Standard GPIO pins are assigned as follows:
// PD0-7 Digital 0-7
// PC0-7 Digital 8-15
// PR0-1 digital 16-17
// PA0-7 analog A0-A7
//
// '#define'ing DIGITAL_IO_PIN_SHIFT shifts this down by 2, and places PD0-1 on 20-21
// This is for Arduino 'atmega' compatibility with respect to existing shields, so that
// you don't have to re-map pin numbers with #defines in existing software that hard-codes them
// or makes assumptions about pin numbers vs functionality [except TWI won't ever match up]
//
// ALL PORT REMAP registers must be assigned to 0 (default mappings for pins)
// Additionally, CLKOUT should be 0 (no clock outputs on any port/pin).
//
// TIMERS
// Timer TC4 should be configured as 'TC4' (for 4 PWM outputs) by default, so that
// PWM output is available on Port C pins 0-3. Port C's timer supports the system clock.
// Port D's timer has only TD5, so only pins 4-7 can be used for PWM output, but
// only 4 and 5 seem to work.  TD5 won't remap the pins at all to 0-4.
//
// See 'E' manual (chapter 13?) on TC4/5 and TD5 for more on this


// --------------------------------------------
// DEFINITIONS FOR SERIAL PORTS AND DEFAULT TWI
// --------------------------------------------

#define DEFAULT_TWI TWIC
#define TWIC_VECT_ENABLE /* use this to select the correct interrupt vectors */

#define DEFAULT_SPI SPIC

// serial port 0
#define SERIAL_0_PORT_NAME PORTD
#define SERIAL_0_USART_NAME USARTD0
#define SERIAL_0_USART_DATA USARTD0_DATA
#define SERIAL_0_RXC_ISR ISR(USARTD0_RXC_vect)
#define SERIAL_0_DRE_ISR ISR(USARTD0_DRE_vect)
//#define SERIAL_0_REMAP PORTD_REMAP /* define THIS to re-map the pins from 0-3 to 4-7 on serial port 0 */
#define SERIAL_0_REMAP_BIT 4    /* the bit needed to remap the port if SERIAL_0_REMAP is defined */
#define SERIAL_0_RX_PIN_INDEX 2 /* the pin number on the port, not the mapped digital pin number */
#define SERIAL_0_TX_PIN_INDEX 3 /* the pin number on the port, not the mapped digital pin number */
#define USARTD0_VECTOR_EXISTS

// serial port 1
#define SERIAL_1_PORT_NAME PORTC
#define SERIAL_1_USART_NAME USARTC0
#define SERIAL_1_USART_DATA USARTC0_DATA
#define SERIAL_1_RXC_ISR ISR(USARTC0_RXC_vect)
#define SERIAL_1_DRE_ISR ISR(USARTC0_DRE_vect)
//#define SERIAL_1_REMAP PORTC_REMAP /* define THIS to re-map the pins from 0-3 to 4-7 on serial port 1 */
#define SERIAL_1_REMAP_BIT 4    /* the bit needed to remap the port if SERIAL_1_REMAP is defined */
#define SERIAL_1_RX_PIN_INDEX 2 /* the pin number on the port, not the mapped digital pin number */
#define SERIAL_1_TX_PIN_INDEX 3 /* the pin number on the port, not the mapped digital pin number */
#define USARTC0_VECTOR_EXISTS


// For atmega/Arduino Uno shield compatibility, with DIGITAL_IO_PIN_SHIFT defined,
// the typical board/pin layout might be like this (for shield pins):
//
// TWI is on TWIC (port C pins 0/1).  pins marked as '~' have PWM
//
//               M M
//             S I O   T R
//         A   C S S S x x
//     S S R G K O I S 2 2              T R
//     C D E N 1 1 1 1                  x x
//     L A F D 3 2 1 0 9 8  7 6 5 4 3 2 1 0
// ----o-o-o-o-o-o-o-o-o-o--o-o-o-o-o-o-o-o----
//     P P P   P P P P P P  P P P P P P P P
//     C C A   C C C C C C  D D D D D D D D
//     1 0 0   5 6 7 4 3 2  1 7 6 5 4 0 3 2
//     ~ ~             ~ ~        ~ ~
//
//               T O P   V I E W
//
//                           p
//               3   3       w  P P P P P P
//               V   V 5     r  A A A A A A
//               3   3 V     +  6 5 4 3 2 1
// ------------o-o-o-o-o-o-o-o--o-o-o-o-o-o----
//             U I R 3 5 G G V  A A A A A A
//             N O E . V N N i  5 4 3 2 1 0
//             U R S 3   D D n
//             S E E V
//             E F T
//             D
//
// RESERVED PINS (not brought out):  PA7, PR0, PR1 (connected to LED_BUILTIN)
//
// ARef should have a 100 ohm (or similar) resistor to Vcc with a decoupling capacitor
// IOREF must be connected to 3.3V so that compatible shields can detect 3.3V logic
// Vin connects to the 'power in' pin (may have 9V or more on this pin)
// 5V can be left unconnected, or use a separate voltage reg for 5V
// 3.3v must be regulated and able to supply 1A or more for shields.
//
// NOTE:  PA0 is connected to 'AREF', and PORTA pins are shifted to PA1 through PA6 for
//        A0 through A5.
//
// As with the MEGA2560 and other 'mega' Arduino boards, additional connectors would
// break out the additional pins, with appropriate labeling.  Additionally, there should
// be an LED on PORTR pin 1 for 'LED_BUILTIN'.
//
// This layout is based on the 'Rev 3' Arduino.  Earlier Arduino didn't have IOREF, SDA, SCL.
//
// Uno has automatic switching between 5V reg out and 5V from USB power.  When Vin is more
// than 6.6v, the Vin source supplies 5V (and 3.3V) to the board.  otherwise, the USB
// 5V power supplies 5V (and 3.3V) to the board.
//
// NOTE:  on the E5, PC7 is MOSI, PC5 is SCK (it's the other way on the other CPUs)
//
// Summary Map:  D0   D1   D2   D3   D4   D5   D6   D7   D8   D9   D10  D11  D12  D13
//               PD2  PD3  PD0  PD4  PD5  PD6  PD7  PD1  PC2  PC3  PC4  PC7  PC6  PC5
//               Rx   Tx                                 Rx2  Tx2  SS   MOSI MISO SCK
//
//               A0   A1   A2   A3   A4   A5
//               PA1  PA2  PA3  PA4  PA5  PA6
//                    DAC0 DAC1
//
// TWIC:  PC0 (SDA), PC1 (SCL)
// AREF:  PA0 (~10k to Vcc)
//
// ASYNC INTERRUPTS:  A1, D0, D8 (can be used for 'wakeup')
//

