XMegaForArduino/arduino/variants/xmega32e5/pins_arduino.h
#ifdef DIGITAL_IO_PIN_SHIFT // aka digital I/O pin 0 is PORTD pin 2, as diagrammed above

// SHIFTED I/O pins (atmega compatibility) - see xmega mod description in comment at top

// default SPI
static const uint8_t SS   = 10;
static const uint8_t MOSI = 11;
static const uint8_t MISO = 12;
static const uint8_t SCK  = 13;

// primary SPI on PC4-7
static const uint8_t SS0   = 10;
static const uint8_t MOSI0 = 11;
static const uint8_t MISO0 = 12;
static const uint8_t SCK0  = 13;

//// secondary SPI on PD4-7 (not present on E series)
//static const uint8_t SS1   = 2;
//static const uint8_t MOSI1 = 3;
//static const uint8_t MISO1 = 4;
//static const uint8_t SCK1  = 5;

// default 2-wire on PC0,PC1 - TWIC
static const uint8_t SDA = 16;
static const uint8_t SCL = 17;

// keep track of the indices for port R since its control register
// settings should be slightly different - D manual table 11-6 etc.
#define PR0 14
#define PR1 15

#else // no digital I/O pin shifting, PORTD pin 0 is digital I/O pin 0 (as it should be)

// default "no shift" pin assignments

// default SPI
static const uint8_t SS   = 12;
static const uint8_t MOSI = 13;
static const uint8_t MISO = 14;
static const uint8_t SCK  = 15;

// primary SPI on PC4-7
static const uint8_t SS0   = 12;
static const uint8_t MOSI0 = 13;
static const uint8_t MISO0 = 14;
static const uint8_t SCK0  = 15;

//// secondary SPI on PD4-7 (not present on E series)
//static const uint8_t SS1   = 4;
//static const uint8_t MOSI1 = 5;
//static const uint8_t MISO1 = 6;
//static const uint8_t SCK1  = 7;

// default 2-wire on PC0,PC1 - TWIC
static const uint8_t SDA = 8;
static const uint8_t SCL = 9;

// keep track of the indices for port R since its control register
// settings should be slightly different - D manual table 11-6 etc.
#define PR0 16
#define PR1 17

#endif // DIGITAL_IO_PIN_SHIFT


// default 'status' LED on PR1
//static const uint8_t LED_BUILTIN = PR1;
#define LED_BUILTIN PR1 /* Arduino 1.06 uses #define, not a const uint8_t */

static const uint8_t A0 = 18;
static const uint8_t A1 = 19;
static const uint8_t A2 = 20;
static const uint8_t A3 = 21;
static const uint8_t A4 = 22;
static const uint8_t A5 = 23;
static const uint8_t A6 = 24;
#ifndef USE_AREF
static const uint8_t A7 = 25;
#endif // USE_AREF

// DIGITAL TO ANALOG CONVERTER DACA
// DACA Output on pins A1 (CH0) and A2 (CH1) when USE_AREF (else A2, A3)

#ifdef USE_AREF
#define DACA_CH0_PIN A1  /* check for #define to determine DACA support */
#define DACA_CH1_PIN A2
#else // !USE_AREF
#define DACA_CH0_PIN A2  /* check for #define to determine DACA support */
#define DACA_CH1_PIN A3
#endif // USE_AREF


// on the xmega 'E' series, PA2, PC2, and PD2 are asynchronous ints.  Others are 'synchronous' which means
// that they must be held in their 'interrupt state' long enough for the system to detect them.  In any case
// all digital input pins can be use as interrupts, synchronous or otherwise.


#ifdef ARDUINO_MAIN

// TODO:  modify 'core' code to have different indices for E series?  For now it's ok as-is

const uint16_t PROGMEM port_to_mode_PGM[] = {
  NOT_A_PORT,                  // 0
  (uint16_t) &PORTA_DIR,       // PA
  NOT_A_PORT,                  // 2  [E series has no 'port B'
  (uint16_t) &PORTC_DIR,       // PC
  (uint16_t) &PORTD_DIR,       // PD
  NOT_A_PORT,                  // 5  [E series has no 'port E'
  (uint16_t) &PORTR_DIR,       // PR
};

const uint16_t PROGMEM port_to_output_PGM[] = {
  NOT_A_PORT,                  // 0
  (uint16_t) &PORTA_OUT,       // PA
  NOT_A_PORT,                  // 2  [E series has no 'port B'
  (uint16_t) &PORTC_OUT,       // PC
  (uint16_t) &PORTD_OUT,       // PD
  NOT_A_PORT,                  // 5  [E series has no 'port E'
  (uint16_t) &PORTR_OUT,       // PR
};

const uint16_t PROGMEM port_to_input_PGM[] = {
  NOT_A_PORT,                  // 0
  (uint16_t) &PORTA_IN,        // PA
  NOT_A_PORT,                  // 2  [E series has no 'port B'
  (uint16_t) &PORTC_IN,        // PC
  (uint16_t) &PORTD_IN,        // PD
  NOT_A_PORT,                  // 5  [E series has no 'port E'
  (uint16_t) &PORTR_IN,        // PR
};

const uint8_t PROGMEM port_to_int0_PGM[] = {
  NOT_AN_INTERRUPT,           // 0
  PORTA_INT0,                 // PA
  NOT_AN_INTERRUPT,           // 2
  PORTC_INT0,                 // PC
  PORTD_INT0,                 // PD
  NOT_AN_INTERRUPT,           // 5
  PORTR_INT0,                 // PR
};

// xmega has a per-pin config register as well.  Normally these will be 00000111 for analog, 00000000 for digital 'totem pole'
// for 'INPUT_PULLUP' these will be 00011111
//   bits 2:0 (trigger)  000 both edges  001 rising  010 falling  011 level  111 input buffer disabled
//            note:  'input buffer disabled' required to use the 'IN' register (so default here)
//                   also port R does not support 'INTPUT_DISABLED' (sic) so use BOTHEDGES [0] instead
//   bits 5:3 (out/pull) 000 TOTEM [normal], 001 bus keeper [sticky], 010 pulldown, 011 pullup,
//                       100 wired 'or', 101 wired 'and', 110 wired 'or' pulldown, 111 wired 'and' pullup
//   bit 6:  "invert logic" (0 = normal, 1 = inverted)
//   bit 7:  unused, must be zero
// NOTE:  PORTA through PORTE (PORTF?) support 'input buffer disabled' and this setting is recommended
//        for analog inputs.  PORTR apparently does NOT support this (set to zero?)

const uint16_t PROGMEM digital_pin_to_control_PGM[] = {
#ifdef DIGITAL_IO_PIN_SHIFT

  (uint16_t) &PORTD_PIN2CTRL,  // PD 2 ** 0 ** USARTD_RX     ASYNC
  (uint16_t) &PORTD_PIN3CTRL,  // PD 3 ** 1 ** USARTD_TX
  (uint16_t) &PORTD_PIN0CTRL,  // PD 0 ** 2 **
  (uint16_t) &PORTD_PIN4CTRL,  // PD 4 ** 3 **
  (uint16_t) &PORTD_PIN5CTRL,  // PD 5 ** 4 **
  (uint16_t) &PORTD_PIN6CTRL,  // PD 6 ** 5 **
  (uint16_t) &PORTD_PIN7CTRL,  // PD 7 ** 6 **
  (uint16_t) &PORTD_PIN1CTRL,  // PD 1 ** 7 ** PC 0,1 must be used for TWI
  (uint16_t) &PORTC_PIN2CTRL,  // PC 2 ** 8 **               ASYNC
  (uint16_t) &PORTC_PIN3CTRL,  // PC 3 ** 9 **
  (uint16_t) &PORTC_PIN4CTRL,  // PC 4 ** 10 ** SPI_SS

