XMegaForArduino/arduino/variants/xmega32e5/pins_arduino.h
  (uint16_t) &PORTC_PIN7CTRL,  // PC 7 ** 11 ** SPI_MOSI
  (uint16_t) &PORTC_PIN6CTRL,  // PC 6 ** 12 ** SPI_MISO
  (uint16_t) &PORTC_PIN5CTRL,  // PC 5 ** 13 ** SPI_SCK

  (uint16_t) &PORTR_PIN0CTRL,  // PR 0 ** 14 **
  (uint16_t) &PORTR_PIN1CTRL,  // PR 1 ** 15 ** default LED
  (uint16_t) &PORTC_PIN0CTRL,  // PC 0 ** 16 ** SDA
  (uint16_t) &PORTC_PIN1CTRL,  // PC 1 ** 17 ** SCL

#else // no DIGITAL_IO_PIN_SHIFT

  (uint16_t) &PORTD_PIN0CTRL,  // PD 0 ** 0 **
  (uint16_t) &PORTD_PIN1CTRL,  // PD 1 ** 1 **
  (uint16_t) &PORTD_PIN2CTRL,  // PD 2 ** 2 ** USARTD_RX     ASYNC
  (uint16_t) &PORTD_PIN3CTRL,  // PD 3 ** 3 ** USARTD_TX
  (uint16_t) &PORTD_PIN4CTRL,  // PD 4 ** 4 **
  (uint16_t) &PORTD_PIN5CTRL,  // PD 5 ** 5 **
  (uint16_t) &PORTD_PIN6CTRL,  // PD 6 ** 6 **
  (uint16_t) &PORTD_PIN7CTRL,  // PD 7 ** 7 **
  (uint16_t) &PORTC_PIN0CTRL,  // PC 0 ** 8 ** SDA
  (uint16_t) &PORTC_PIN1CTRL,  // PC 1 ** 9 ** SCL
  (uint16_t) &PORTC_PIN2CTRL,  // PC 2 ** 10 **              ASYNC
  (uint16_t) &PORTC_PIN3CTRL,  // PC 3 ** 11 **
  (uint16_t) &PORTC_PIN4CTRL,  // PC 4 ** 12 ** SPI_SS
  (uint16_t) &PORTC_PIN5CTRL,  // PC 5 ** 13 ** SPI_SCK
  (uint16_t) &PORTC_PIN6CTRL,  // PC 6 ** 14 ** SPI_MISO
  (uint16_t) &PORTC_PIN7CTRL,  // PC 7 ** 15 ** SPI_MOSI
  (uint16_t) &PORTR_PIN0CTRL,  // PR 0 ** 16 **
  (uint16_t) &PORTR_PIN1CTRL,  // PR 1 ** 17 ** default LED

#endif // DIGITAL_IO_PIN_SHIFT

#ifndef USE_AREF
  (uint16_t) &PORTA_PIN0CTRL,  // PA 0 ** 18 ** A0           AREF (when USE_AREF is defined, and then it won't be mapped)
#endif // USE_AREF
  // subtract 1 from the corresponding digital pin number if for USE_AREF
  (uint16_t) &PORTA_PIN1CTRL,  // PA 1 ** 19 ** A1
  (uint16_t) &PORTA_PIN2CTRL,  // PA 2 ** 20 ** A2           ASYNC
  (uint16_t) &PORTA_PIN3CTRL,  // PA 3 ** 21 ** A3
  (uint16_t) &PORTA_PIN4CTRL,  // PA 4 ** 22 ** A4
  (uint16_t) &PORTA_PIN5CTRL,  // PA 5 ** 23 ** A5
  (uint16_t) &PORTA_PIN6CTRL,  // PA 6 ** 24 ** A6
  (uint16_t) &PORTA_PIN7CTRL,  // PA 7 ** 25 ** A7
};

const uint8_t PROGMEM digital_pin_to_port_PGM[] = {
  // PORTLIST
  // -------------------------------------------

#ifdef DIGITAL_IO_PIN_SHIFT

  _PD,  // PD 2 ** 0 ** USARTD_RX
  _PD,  // PD 3 ** 1 ** USARTD_TX
  _PD,  // PD 0 ** 2 **
  _PD,  // PD 4 ** 3 **
  _PD,  // PD 5 ** 4 **
  _PD,  // PD 6 ** 5 **
  _PD,  // PD 7 ** 6 **
  _PD,  // PD 1 ** 7 **
  _PC,  // PC 2 ** 8 **
  _PC,  // PC 3 ** 9 **
  _PC,  // PC 4 ** 10 ** SPI_SS
  _PC,  // PC 7 ** 11 ** SPI_MOSI
  _PC,  // PC 6 ** 12 ** SPI_MISO
  _PC,  // PC 5 ** 13 ** SPI_SCK
  _PR,  // PR 0 ** 14 **
  _PR,  // PR 1 ** 15 ** default LED
  _PC,  // PC 0 ** 16 ** SDA
  _PC,  // PC 1 ** 17 ** SCL

#else // no pin shifting

  _PD,  // PD 0 ** 0 **
  _PD,  // PD 1 ** 1 **
  _PD,  // PD 2 ** 2 ** USARTD_RX
  _PD,  // PD 3 ** 3 ** USARTD_TX
  _PD,  // PD 4 ** 4 **
  _PD,  // PD 5 ** 5 **
  _PD,  // PD 6 ** 6 **
  _PD,  // PD 7 ** 7 **
  _PC,  // PC 0 ** 8 ** SDA
  _PC,  // PC 1 ** 9 ** SCL
  _PC,  // PC 2 ** 10 **
  _PC,  // PC 3 ** 11 **
  _PC,  // PC 4 ** 12 ** SPI_SS
  _PC,  // PC 5 ** 13 ** SPI_SCK
  _PC,  // PC 6 ** 14 ** SPI_MISO
  _PC,  // PC 7 ** 15 ** SPI_MOSI
  _PR,  // PR 0 ** 16 **
  _PR,  // PR 1 ** 17 ** default LED

#endif // DIGITAL_IO_PIN_SHIFT

#ifndef USE_AREF
  _PA,  // PA 0 ** 18 ** A0
#endif // USE_AREF
  _PA,  // PA 1 ** 19 ** A1
  _PA,  // PA 2 ** 20 ** A2
  _PA,  // PA 3 ** 21 ** A3
  _PA,  // PA 4 ** 22 ** A4
  _PA,  // PA 5 ** 23 ** A5
  _PA,  // PA 6 ** 24 ** A6
  _PA,  // PA 7 ** 25 ** A7
};

const uint8_t PROGMEM digital_pin_to_bit_mask_PGM[] = {
  // PIN IN PORT
  // -------------------------------------------
#ifdef DIGITAL_IO_PIN_SHIFT

  _BV( 2 ),  // PD 2 ** 0 ** USARTD_RX
  _BV( 3 ),  // PD 3 ** 1 ** USARTD_TX
  _BV( 0 ),  // PD 0 ** 2 **
  _BV( 4 ),  // PD 4 ** 3 **
  _BV( 5 ),  // PD 5 ** 4 **
  _BV( 6 ),  // PD 6 ** 5 **
  _BV( 7 ),  // PD 7 ** 6 **
  _BV( 1 ),  // PD 1 ** 7 **
  _BV( 2 ),  // PC 2 ** 8 **
  _BV( 3 ),  // PC 3 ** 9 **
  _BV( 4 ),  // PC 4 ** 10 ** SPI_SS
  _BV( 7 ),  // PC 7 ** 11 ** SPI_MOSI
  _BV( 6 ),  // PC 6 ** 12 ** SPI_MISO
  _BV( 5 ),  // PC 5 ** 13 ** SPI_SCK
  _BV( 0 ),  // PR 0 ** 14 **
  _BV( 1 ),  // PR 1 ** 15 ** default LED
  _BV( 0 ),  // PC 0 ** 16 ** SDA
  _BV( 1 ),  // PC 1 ** 17 ** SCL

#else // no pin shifting
  _BV( 0 ),  // PD 0 ** 0 **
  _BV( 1 ),  // PD 1 ** 1 **
  _BV( 2 ),  // PD 2 ** 2 ** USARTD_RX
  _BV( 3 ),  // PD 3 ** 3 ** USARTD_TX
  _BV( 4 ),  // PD 4 ** 4 **
  _BV( 5 ),  // PD 5 ** 5 **
  _BV( 6 ),  // PD 6 ** 6 **
  _BV( 7 ),  // PD 7 ** 7 **
  _BV( 0 ),  // PC 0 ** 8 ** SDA
  _BV( 1 ),  // PC 1 ** 9 ** SCL
  _BV( 2 ),  // PC 2 ** 10 **
  _BV( 3 ),  // PC 3 ** 11 **
  _BV( 4 ),  // PC 4 ** 12 ** SPI_SS
  _BV( 5 ),  // PC 5 ** 13 ** SPI_SCK
  _BV( 6 ),  // PC 6 ** 14 ** SPI_MISO
  _BV( 7 ),  // PC 7 ** 15 ** SPI_MOSI
  _BV( 0 ),  // PR 0 ** 16 **
  _BV( 1 ),  // PR 1 ** 17 ** default LED

#endif // DIGITAL_IO_PIN_SHIFT

#ifndef USE_AREF
  _BV( 0 ),  // PA 0 ** 18 ** A0
#endif // USE_AREF
  _BV( 1 ),  // PA 1 ** 19 ** A1
  _BV( 2 ),  // PA 2 ** 20 ** A2
  _BV( 3 ),  // PA 3 ** 21 ** A3
  _BV( 4 ),  // PA 4 ** 22 ** A4
  _BV( 5 ),  // PA 5 ** 23 ** A5
  _BV( 6 ),  // PA 6 ** 24 ** A6
  _BV( 7 ),  // PA 7 ** 25 ** A7
};




const uint8_t PROGMEM digital_pin_to_timer_PGM[] = {
  // TIMERS
  // -------------------------------------------
  // The timers on the E5 are a bit different than the others
  // Since TIMERD5 only goes tp PD4, PD5, PD6, PD7, I have to
  // map them to places that have PWM.  Also, PD6 and PD7 don't
  // seem to work very well.  PC0 through PC3 work pretty well,
  // but PC0 and PC1 are TWI pins.  As such, the mapping won't
  // work very well if Arduino compatibility is desired.
#ifdef DIGITAL_IO_PIN_SHIFT

  NOT_ON_TIMER,  // PD 2 ** 0 ** USARTD_RX
  NOT_ON_TIMER,  // PD 3 ** 1 ** USARTD_TX
  NOT_ON_TIMER,  // PD 0 ** 2 ** non-PWM 2
  TIMERD5,       // PD 4 ** 3 ** PWM 3
  TIMERD5,       // PD 5 ** 4 ** PWM 4
  NOT_ON_TIMER,  //TIMERD5,       // PD 6 ** 5 ** PWM 5
  NOT_ON_TIMER,  //TIMERD5,       // PD 7 ** 6 ** PWM 6
  NOT_ON_TIMER,  // PD 1 ** 7 **
  TIMERC4,       // PC 2 ** 8 **
  TIMERC4,       // PC 3 ** 9 **
  NOT_ON_TIMER,  //TIMERC4,       // PC 4 ** 10 ** SPI_SS
  NOT_ON_TIMER,  //TIMERC4,       // PC 7 ** 11 ** SPI_MOSI
  NOT_ON_TIMER,  //TIMERC4,       // PC 6 ** 12 ** SPI_MISO
  NOT_ON_TIMER,  //TIMERC4,       // PC 5 ** 13 ** SPI_SCK
  NOT_ON_TIMER,  // PR 0 ** 14 **
  NOT_ON_TIMER,  // PR 1 ** 15 ** default LED
  TIMERC4,       // PC 0 ** 16 **
  TIMERC4,       // PC 1 ** 17 **

#else // no pin shifting

