XMegaForArduino/arduino/variants/xmega32e5/pins_arduino.h
  NOT_ON_TIMER,  // PD 0 ** 0 **
  NOT_ON_TIMER,  // PD 1 ** 1 **
  NOT_ON_TIMER,  // PD 2 ** 2 ** USARTD_RX
  NOT_ON_TIMER,  // PD 3 ** 3 ** USARTD_TX
  TIMERD5,       // PD 4 ** 4 ** PWM 3
  TIMERD5,       // PD 5 ** 5 ** PWM 4
  NOT_ON_TIMER,  //TIMERD5,       // PD 6 ** 6 ** PWM 5
  NOT_ON_TIMER,  //TIMERD5,       // PD 7 ** 7 ** PWM 6
  TIMERC4,       // PC 0 ** 8 ** SDA
  TIMERC4,       // PC 1 ** 9 ** SCL
  TIMERC4,       // PC 2 ** 10 **
  TIMERC4,       // PC 3 ** 11 **
  NOT_ON_TIMER,  //TIMERC4,       // PC 4 ** 12 ** SPI_SS
  NOT_ON_TIMER,  //TIMERC4,       // PC 5 ** 13 ** SPI_SCK
  NOT_ON_TIMER,  //TIMERC4,       // PC 6 ** 14 ** SPI_MISO
  NOT_ON_TIMER,  //TIMERC4,       // PC 7 ** 15 ** SPI_MOSI
  NOT_ON_TIMER,  // PR 0 ** 16 **
  NOT_ON_TIMER,  // PR 1 ** 17 ** default LED

#endif // DIGITAL_IO_PIN_SHIFT

#ifndef USE_AREF
  NOT_ON_TIMER,  // PA 0 ** 18 ** A0
#endif // USE_AREF
  NOT_ON_TIMER,  // PA 1 ** 19 ** A1
  NOT_ON_TIMER,  // PA 2 ** 20 ** A2
  NOT_ON_TIMER,  // PA 3 ** 21 ** A3
  NOT_ON_TIMER,  // PA 4 ** 22 ** A4
  NOT_ON_TIMER,  // PA 5 ** 23 ** A5
  NOT_ON_TIMER,  // PA 6 ** 24 ** A6
  NOT_ON_TIMER,  // PA 7 ** 25 ** A7
};

#endif


// These serial port names are intended to allow libraries and architecture-neutral
// sketches to automatically default to the correct port name for a particular type
// of use.  For example, a GPS module would normally connect to SERIAL_PORT_HARDWARE_OPEN,
// the first hardware serial port whose RX/TX pins are not dedicated to another use.
//
// SERIAL_PORT_MONITOR        Port which normally prints to the Arduino Serial Monitor
//
// SERIAL_PORT_USBVIRTUAL     Port which is USB virtual serial
//
// SERIAL_PORT_LINUXBRIDGE    Port which connects to a Linux system via Bridge library
//
// SERIAL_PORT_HARDWARE       Hardware serial port, physical RX & TX pins.
//
// SERIAL_PORT_HARDWARE_OPEN  Hardware serial ports which are open for use.  Their RX & TX
//                            pins are NOT connected to anything by default.
#define SERIAL_PORT_MONITOR   Serial
#define SERIAL_PORT_HARDWARE  Serial
#define SERIAL_HARDWARE_OPEN  Serial2

#endif


